const paragraphs = [
    "تعرف لي انا عمري مكرهتك و لا عمري باش نكرهك و لا عمري باش نحب غيرك",
    "انا مباركة عمري كامل سمعت منك كان لعرك احلي كلمة قلتها نحبك في لحظة عارفك موش من قلبك",
    "تمنيتك حلالي عمري لا لعبت بيك و لا عمري خليتك في اي حاجة برغم",
    "لي انتي تتغشش برشا",
    "و ديما تعاير فيا",
    "تقول في حاجات و تعرف روحك اكثر مني ",
    "انا حبيتك و حاجة هاذي ماننكرهاش تعبت و تحملت لعذاب و راصتلي مريض",
    "عادي انا مانيش قوي نورمال مفما حتا مشكل",
    "انا مخسرت شي صحيح خسرت قطعة من قلبي و كل شي تعبت علي خاطرو",
    "جيتك حتا لغادي و اما متصورتكش باش يجي نهار و طيشني و لا تبدلني و لا تهيني حتا كان في مصلحتي",
    "تحب كرهبة و دار و خدمة و الخ الخ الخ ههه",
    "اي هاني نقري تو و بعد انا حاولت قد منجم انتي شخسرت علية كان هاك كذاب و بيك و عليك",
    "و انتي وحدك ترا فيهم هاكم خاتر حاشتك بحد انتي تحبو و هو ميحبكش ",
    "خلاصة انا قدام ربي يعرف اني حبيتك و تمنيتك و انتي اخترت تبعد موش انا ",

    
  ];
  
  const button = document.getElementById("myButton");
  const div = document.getElementById("myDiv");
  let index = 0;
  
  button.addEventListener("click", function() {
    if (index >= paragraphs.length) {
      div.textContent = "فاروق لي تكرهو يقلك نحبك اما راني مانيش لك درجة خايب كيف في مخك و منتبدلش عمري كامل اما صعيب كان نجم نراك مرا اخري نحبك";
    } else {
      div.textContent = paragraphs[index];
      index++;
    }
  });
  